---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructureLayer.LayerCapFlag
source: html/692333a8-4879-bec3-cb25-9eece96a1bea.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.LayerCapFlag Property

Identifies if the layer participates in wrapping at end caps and/or inserts.

## Syntax (C#)
```csharp
public bool LayerCapFlag { get; set; }
```